src/soap/MantisConnectBinding.mc_project_add.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://futureware.biz/mantisconnect">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:mc_project_add>
   <username></username>
   <password></password>
   <project>
    <id></id>
    <name></name>
    <status>
     <id></id>
     <name></name>
    </status>
    <enabled>false</enabled>
    <view_state>
     <id></id>
     <name></name>
    </view_state>
    <access_min>
     <id></id>
     <name></name>
    </access_min>
    <file_path></file_path>
    <description></description>
    <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
     <item>
      <id></id>
      <name></name>
      <status>
       <id></id>
       <name></name>
      </status>
      <enabled>false</enabled>
      <view_state>
       <id></id>
       <name></name>
      </view_state>
      <access_min>
       <id></id>
       <name></name>
      </access_min>
      <file_path></file_path>
      <description></description>
      <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
       <item>
        <id></id>
        <name></name>
        <status>
         <id></id>
         <name></name>
        </status>
        <enabled>false</enabled>
        <view_state>
         <id></id>
         <name></name>
        </view_state>
        <access_min>
         <id></id>
         <name></name>
        </access_min>
        <file_path></file_path>
        <description></description>
        <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        </subprojects>
        <inherit_global>false</inherit_global>
       </item>
      
       <item>
        <id></id>
        <name></name>
        <status>
         <id></id>
         <name></name>
        </status>
        <enabled>false</enabled>
        <view_state>
         <id></id>
         <name></name>
        </view_state>
        <access_min>
         <id></id>
         <name></name>
        </access_min>
        <file_path></file_path>
        <description></description>
        <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        </subprojects>
        <inherit_global>false</inherit_global>
       </item>
      </subprojects>
      <inherit_global>false</inherit_global>
     </item>
    
     <item>
      <id></id>
      <name></name>
      <status>
       <id></id>
       <name></name>
      </status>
      <enabled>false</enabled>
      <view_state>
       <id></id>
       <name></name>
      </view_state>
      <access_min>
       <id></id>
       <name></name>
      </access_min>
      <file_path></file_path>
      <description></description>
      <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
       <item>
        <id></id>
        <name></name>
        <status>
         <id></id>
         <name></name>
        </status>
        <enabled>false</enabled>
        <view_state>
         <id></id>
         <name></name>
        </view_state>
        <access_min>
         <id></id>
         <name></name>
        </access_min>
        <file_path></file_path>
        <description></description>
        <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        </subprojects>
        <inherit_global>false</inherit_global>
       </item>
      
       <item>
        <id></id>
        <name></name>
        <status>
         <id></id>
         <name></name>
        </status>
        <enabled>false</enabled>
        <view_state>
         <id></id>
         <name></name>
        </view_state>
        <access_min>
         <id></id>
         <name></name>
        </access_min>
        <file_path></file_path>
        <description></description>
        <subprojects SOAP-ENC:arrayType="ns1:ProjectData[1]">
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        
         <item>
          <id></id>
          <name></name>
          <file_path></file_path>
          <description></description>
         </item>
        </subprojects>
        <inherit_global>false</inherit_global>
       </item>
      </subprojects>
      <inherit_global>false</inherit_global>
     </item>
    </subprojects>
    <inherit_global>false</inherit_global>
   </project>
  </ns1:mc_project_add>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
